#pragma once

enum
{
	/** Идентификаторы параметров */
	 kVuPPMId /// Параметр измерителя громкости выходного сигнала VuMeter
  ,kGainId /// Параметр громкости выходного сигнала
	,kLengthId /// Параметр длины виртуального помещения
	,kWidthId /// Параметр длины виртуального помещения
	,kHeightId /// Параметр длины виртуального помещения
	,kReflectionId /// Параметр степени отражения сигнала от стен виртуального помещения
	,kXPosId /// Параметр положения источника/приёмника по x
	,kYPosId /// Параметр положения источника/приёмника по y
	,kZPosId /// Параметр положения источника/приёмника по z
	,kBypassId /// Параметр проброса
	,kResetId /// Параметр сброса
};
