#pragma once

namespace Steinberg {
namespace Vst {

//------------------------------------------------------------------------
// MathReverbGraph: Декларация
// Математическая модель плагина
// Помещение внутри которого происходит преобразование звука
//------------------------------------------------------------------------
class MathReverbGraph
{
public:
  // Конструктор
  MathReverbGraph ();
  // Деструктор
  ~MathReverbGraph ();

  // Метод обрабоки очередного семпла
  // template <typename SampleType>
  float process (float inSample);
};

//------------------------------------------------------------------------
} // Пространство имён Vst
} // Пространство имён Steinberg
